# BackgroundDraftPatternIdParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BackgroundDraftPatternIdParam Property
ParameterTypeId Class See Also
---
"Background Fill Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BackgroundDraftPatternIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BackgroundDraftPatternIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BackgroundDraftPatternIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace